arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_flexio_hal.h
 /*! @brief Timer decrement options */
typedef enum _flexio_timer_decrement
{
    FLEXIO_TIMER_DECREMENT_CLK_SHIFT_TMR      = 0x00U,  /*!< Decrement counter on FlexIO clock, Shift clock equals Timer output. */
    FLEXIO_TIMER_DECREMENT_TRG_SHIFT_TMR      = 0x01U,  /*!< Decrement counter on Trigger input (both edges), Shift clock equals Timer output. */
    FLEXIO_TIMER_DECREMENT_PIN_SHIFT_PIN      = 0x02U,  /*!< Decrement counter on Pin input (both edges), Shift clock equals Pin input. */
    FLEXIO_TIMER_DECREMENT_TRG_SHIFT_TRG      = 0x03U,  /*!< Decrement counter on Trigger input (both edges), Shift clock equals Trigger input. */
} flexio_timer_decrement_t;

 /*! @brief Timer reset options */
typedef enum _flexio_timer_reset
{
    FLEXIO_TIMER_RESET_NEVER                  = 0x00U,  /*!< Timer never reset. */
    FLEXIO_TIMER_RESET_PIN_OUT                = 0x02U,  /*!< Timer reset on Timer Pin equal to Timer Output. */
    FLEXIO_TIMER_RESET_TRG_OUT                = 0x03U,  /*!< Timer reset on Timer Trigger equal to Timer Output. */
    FLEXIO_TIMER_RESET_PIN_RISING             = 0x04U,  /*!< Timer reset on Timer Pin rising edge. */
    FLEXIO_TIMER_RESET_TRG_RISING             = 0x06U,  /*!< Timer reset on Trigger rising edge. */
    FLEXIO_TIMER_RESET_TRG_BOTH               = 0x07U,  /*!< Timer reset on Trigger rising or falling edge. */
} flexio_timer_reset_t;

 /*! @brief Timer disable options */
typedef enum _flexio_timer_disable
{
    FLEXIO_TIMER_DISABLE_NEVER                = 0x00U,  /*!< Timer never disabled. */
    FLEXIO_TIMER_DISABLE_TIM_DISABLE          = 0x01U,  /*!< Timer disabled on Timer N-1 disable. */
    FLEXIO_TIMER_DISABLE_TIM_CMP              = 0x02U,  /*!< Timer disabled on Timer compare. */
    FLEXIO_TIMER_DISABLE_TIM_CMP_TRG_LOW      = 0x03U,  /*!< Timer disabled on Timer compare and Trigger Low. */
    FLEXIO_TIMER_DISABLE_PIN                  = 0x04U,  /*!< Timer disabled on Pin rising or falling edge. */
    FLEXIO_TIMER_DISABLE_PIN_TRG_HIGH         = 0x05U,  /*!< Timer disabled on Pin rising or falling edge provided Trigger is high. */
    FLEXIO_TIMER_DISABLE_TRG                  = 0x06U,  /*!< Timer disabled on Trigger falling edge. */
} flexio_timer_disable_t;

 /*! @brief Timer disable options */
typedef enum _flexio_timer_enable
{
    FLEXIO_TIMER_ENABLE_ALWAYS                  = 0x00U,  /*!< Timer always enabled. */
    FLEXIO_TIMER_ENABLE_TIM_ENABLE              = 0x01U,  /*!< Timer enabled on Timer N-1 enable. */
    FLEXIO_TIMER_ENABLE_TRG_HIGH                = 0x02U,  /*!< Timer enabled on Trigger high. */
    FLEXIO_TIMER_ENABLE_TRG_PIN_HIGH            = 0x03U,  /*!< Timer enabled on Trigger high and Pin high. */
    FLEXIO_TIMER_ENABLE_PIN_POSEDGE             = 0x04U,  /*!< Timer enabled on Pin rising edge. */
    FLEXIO_TIMER_ENABLE_PIN_POSEDGE_TRG_HIGH    = 0x05U,  /*!< Timer enabled on Pin rising edge and Trigger high. */
    FLEXIO_TIMER_ENABLE_TRG_POSEDGE             = 0x06U,  /*!< Timer enabled on Trigger rising edge. */
    FLEXIO_TIMER_ENABLE_TRG_EDGE                = 0x07U,  /*!< Timer enabled on Trigger rising or falling edge. */
} flexio_timer_enable_t;

 /*! @brief Timer stop bit options */
typedef enum _flexio_timer_stop
{
    FLEXIO_TIMER_STOP_BIT_DISABLED              = 0x00U,  /*!< Stop bit disabled. */
    FLEXIO_TIMER_STOP_BIT_TIM_CMP               = 0x01U,  /*!< Stop bit is enabled on timer compare. */
    FLEXIO_TIMER_STOP_BIT_TIM_DIS               = 0x02U,  /*!< Stop bit is enabled on timer disable. */
    FLEXIO_TIMER_STOP_BIT_TIM_CMP_DIS           = 0x03U,  /*!< Stop bit is enabled on timer compare and disable. */
} flexio_timer_stop_t;

 /*! @brief Timer stop bit options - for Transmit, Receive or Match Store modes only */
typedef enum _flexio_shifter_stop
{
    FLEXIO_SHIFTER_STOP_BIT_DISABLED            = 0x00U,  /*!< Stop bit disabled. */
    FLEXIO_SHIFTER_STOP_BIT_0                   = 0x02U,  /*!< Transmit/expect stop bit value 0 */
    FLEXIO_SHIFTER_STOP_BIT_1                   = 0x03U,  /*!< Transmit/expect stop bit value 1 */
} flexio_shifter_stop_t;

 /*! @brief Timer start bit options - for Transmit, Receive or Match Store modes only */
typedef enum _flexio_shifter_start
{
    FLEXIO_SHIFTER_START_BIT_DISABLED       = 0x00U,  /*!< Start bit disabled, transmitter loads data on enable */
    FLEXIO_SHIFTER_START_BIT_DISABLED_SH    = 0x01U,  /*!< Start bit disabled, transmitter loads data on first shift */
    FLEXIO_SHIFTER_START_BIT_0              = 0x02U,  /*!< Transmit/expect start bit value 0 */
    FLEXIO_SHIFTER_START_BIT_1              = 0x03U,  /*!< Transmit/expect start bit value 1 */
} flexio_shifter_start_t;

 /*! @brief Timer start bit options */
typedef enum _flexio_timer_start
{
    FLEXIO_TIMER_START_BIT_DISABLED              = 0x00U,  /*!< Start bit disabled. */
    FLEXIO_TIMER_START_BIT_ENABLED               = 0x01U,  /*!< Start bit enabled. */
} flexio_timer_start_t;

/*! @brief FlexIO module version number */
typedef struct
{
    uint8_t  majorNumber;       /**< Major Version Number */
    uint8_t  minorNumber;       /**< Minor Version Number */
    uint16_t featureNumber;     /**< Feature Specification Number */
} flexio_version_info_t;


/*******************************************************************************
 * API
 ******************************************************************************/
/*!
 * @name Template Group
 * @{
 */

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Reads the version of the FlexIO module
 *
 * This function reads the version number of the FLEXIO hardware module
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @param[out] versionInfo Device Version Number
 */
static inline void FLEXIO_HAL_GetVersion(FLEXIO_Type *baseAddr, flexio_version_info_t *versionInfo)
{
    uint32_t tmp = baseAddr->VERID;
    versionInfo->majorNumber = (tmp & FLEXIO_VERID_MAJOR_MASK) >> FLEXIO_VERID_MAJOR_SHIFT;
    versionInfo->minorNumber = (tmp & FLEXIO_VERID_MINOR_MASK) >> FLEXIO_VERID_MINOR_SHIFT;
    versionInfo->featureNumber = (tmp & FLEXIO_VERID_FEATURE_MASK) >> FLEXIO_VERID_FEATURE_SHIFT;
    return;
}


/*!
 * @brief Returns the number of external triggers of the FlexIO module
 *
 * This function returns the number of external triggers of the FlexIO module
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @return  the number of external triggers of the FlexIO module.
 */
static inline uint8_t FLEXIO_HAL_GetTriggerNum(FLEXIO_Type *baseAddr)
{
    uint32_t tmp = baseAddr->PARAM;
    tmp = (tmp & FLEXIO_PARAM_TRIGGER_MASK) >> FLEXIO_PARAM_TRIGGER_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Returns the number of pins of the FlexIO module
 *
 * This function returns the number of pins of the FlexIO module
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @return  the number of pins of the FlexIO module.
 */
static inline uint8_t FLEXIO_HAL_GetPinNum(FLEXIO_Type *baseAddr)
{
    uint32_t tmp = baseAddr->PARAM;
    tmp = (tmp & FLEXIO_PARAM_PIN_MASK) >> FLEXIO_PARAM_PIN_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Returns the number of timers of the FlexIO module
 *
 * This function returns the number of timers of the FlexIO module
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @return  the number of timers of the FlexIO module.
 */
static inline uint8_t FLEXIO_HAL_GetTimerNum(FLEXIO_Type *baseAddr)
{
    uint32_t tmp = baseAddr->PARAM;
    tmp = (tmp & FLEXIO_PARAM_TIMER_MASK) >> FLEXIO_PARAM_TIMER_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Returns the number of shifters of the FlexIO module
 *
 * This function returns the number of shifters of the FlexIO module
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @return  the number of shifters of the FlexIO module.
 */
static inline uint8_t FLEXIO_HAL_GetShifterNum(FLEXIO_Type *baseAddr)
{
    uint32_t tmp = baseAddr->PARAM;
    tmp = (tmp & FLEXIO_PARAM_SHIFTER_MASK) >> FLEXIO_PARAM_SHIFTER_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Returns the current doze mode setting
 *
 * This function returns the current doze mode setting for the FlexIO module
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @return  The current doze mode setting.
 */
static inline bool FLEXIO_HAL_GetDozeMode(FLEXIO_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_DOZEN_SHIFT);
}


/*!
 * @brief Set the FlexIO module behavior in doze mode
 *
 * This function enables of disables FlexIO functionality in doze mode.
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @param[in] enable  Specifies whether to enable or disable FlexIO in doze mode
 */
static inline void FLEXIO_HAL_SetDozeMode(FLEXIO_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_DOZEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Returns the current debug mode setting
 *
 * This function returns the current debug mode setting for the FlexIO module
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @return  The current debug mode setting.
 */
static inline bool FLEXIO_HAL_GetDebugMode(FLEXIO_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_DBGE_SHIFT);
}


/*!
 * @brief Set the FlexIO module behavior in debug mode
 *
 * This function enables of disables FlexIO functionality in debug mode.
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @param[in] enable  Specifies whether to enable or disable FlexIO in debug mode
 */
static inline void FLEXIO_HAL_SetDebugMode(FLEXIO_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_DBGE_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Returns the current fast access setting
 *
 * This function returns the current fast access setting for the FlexIO module.
 * Fast access allows faster accesses to FlexIO registers, but requires the FlexIO
 * clock to be at least twice the frequency of the bus clock.
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @return  The current fast access setting.
 */
static inline bool FLEXIO_HAL_GetFastAccess(FLEXIO_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_FASTACC_SHIFT);
}


/*!
 * @brief Configure the FlexIO fast access feature.
 *
 * This function enables of disables the fast access feature for the FlexIO module.
 * Fast access allows faster accesses to FlexIO registers, but requires the FlexIO
 * clock to be at least twice the frequency of the bus clock.
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @param[in] enable Enables fast register accesses to FlexIO registers
 */
static inline void FLEXIO_HAL_SetFastAccess(FLEXIO_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_FASTACC_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Returns the current software reset state
 *
 * This function returns the state of the FlexIO software reset bit.
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @return  The current software reset setting.
 */
static inline bool FLEXIO_HAL_GetSoftwareReset(FLEXIO_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_SWRST_SHIFT);
}


/*!
 * @brief Set/clear the FlexIO reset command
 *
 * Calling this function with enable parameter set to true resets all internal
 * master logic and registers, except the FlexIO Control Register. The reset state
 * persists until this function is called with enable parameter set to false.
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @param[in] enable Specifies the reset state of the FlexIO logic
 */
static inline void FLEXIO_HAL_SetSoftwareReset(FLEXIO_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_SWRST_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Returns the current enable/disable setting of the FlexIO
 *
 * This function checks whether or not the FlexIO module is enabled.
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @return  The current enable/disable setting.
 */
static inline bool FLEXIO_HAL_GetEnable(FLEXIO_Type *baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_FLEXEN_SHIFT);
}


/*!
 * @brief Enables of disables the FlexIO module
 *
 * This function enables or disables the FlexIO module.
 *
 * @param[in] baseAddr Base address of the FlexIO module
 * @param[in] enable Specifies the enable/disable state of the FlexIO module
 */
static inline void FLEXIO_HAL_SetEnable(FLEXIO_Type *baseAddr, bool enable)
{
    BITBAND_ACCESS32(&(baseAddr->CTRL), FLEXIO_CTRL_FLEXEN_SHIFT) = (uint32_t)enable;
}


/*!
 * @brief Returns the current input data read from the FlexIO pins
 *
 * This function returns the data read from all the FLEXIO pins. Only the lower
 * n bits are valid, where n is the number of pins returned by FLEXIO_HAL_GetPinNum().
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @return  Data read from the FlexIO pins.
 */
static inline uint8_t FLEXIO_HAL_GetPinData(FLEXIO_Type *baseAddr)
{
    uint32_t tmp = baseAddr->PIN;
    tmp = (tmp & FLEXIO_PIN_PDI_MASK) >> FLEXIO_PIN_PDI_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Returns the current status of the specified shifter.
 *
 * This function returns the value of the status flag for the specified shifter.
 * The meaning of the status flag depends on the current mode.
 *  - Transmit mode: shifter buffer is empty and ready to accept more data
 *  - Receive mode: shifter buffer is full and received data can be read from it
 *  - Match Store mode: match occurred between shifter buffer and shifter
 *  - Match Continuous mode: current match result between shifter buffer and shifter
 *  - State mode: shifter is selected by current state pointer
 *  - Logic mode: current value of the programmable logic block output
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @return  Status of the specified shifter.
 */
static inline bool FLEXIO_HAL_GetShifterStatus(FLEXIO_Type *baseAddr, uint8_t shifter)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    return (bool)BITBAND_ACCESS32(&(baseAddr->SHIFTSTAT), shifter);
}


/*!
 * @brief Clears the status of the specified shifter.
 *
 * This function clears the status flag for the specified shifter. This is possible in
 * all modes except Match Continuous mode.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 */
static inline void FLEXIO_HAL_ClearShifterStatus(FLEXIO_Type *baseAddr, uint8_t shifter)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    baseAddr->SHIFTSTAT = 1UL << shifter;
}


/*!
 * @brief Returns the current error status of the specified shifter.
 *
 * This function returns the value of the error status flag for the specified shifter.
 * The meaning of the error status flag depends on the current mode.
 *  - Transmit mode: shifter buffer was not written before it was transferred in the shifter (buffer overrun)
 *  - Receive mode: shifter buffer was not read before new data was transferred from the shifter (buffer underrun)
 *  - Match Store mode: match event occurred before the previous match data was read from shifter buffer (buffer overrun)
 *  - Match Continuous mode: match occurred between shifter buffer and shifter
 *  - Logic mode: set when the output of the programmable logic block has asserted
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @return  Error status of the specified shifter.
 */
static inline bool FLEXIO_HAL_GetShifterErrorStatus(FLEXIO_Type *baseAddr, uint8_t shifter)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    return (bool)BITBAND_ACCESS32(&(baseAddr->SHIFTERR), shifter);
}


/*!
 * @brief Clears the error status of the specified shifter.
 *
 * This function clears the error status flag for the specified shifter.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 */
static inline void FLEXIO_HAL_ClearShifterErrorStatus(FLEXIO_Type *baseAddr, uint8_t shifter)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    baseAddr->SHIFTERR = 1UL << shifter;
}


/*!
 * @brief Returns the current status of the specified timer.
 *
 * This function returns the value of the status flag for the specified timer.
 * The meaning of the status flag depends on the current mode.
 *  - 8-bit counter mode: the timer status flag is set when the upper 8-bit counter equals zero
 * and decrements. This also causes the counter to reload with the value in the compare register.
 *  - 8-bit PWM mode: the upper 8-bit counter equals zero and decrements. This also causes the
 * counter to reload with the value in the compare register.
 *  - 16-bit counter mode: the 16-bit counter equals zero and decrements. This also causes the
 * counter to reload with the value in the compare register.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return  Status of the specified timer.
 */
static inline bool FLEXIO_HAL_GetTimerStatus(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    return (bool)BITBAND_ACCESS32(&(baseAddr->TIMSTAT), timer);
}


/*!
 * @brief Clears the status of the specified timer.
 *
 * This function clears the status flag for the specified timer.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 */
static inline void FLEXIO_HAL_ClearTimerStatus(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    baseAddr->TIMSTAT = 1UL << timer;
}


/*!
 * @brief Returns the current status of the shifter interrupts.
 *
 * Returns the state of the interrupt for the specified shifter.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] interruptNo Number of the interrupt (shifter).
 * @return  Status of the specified interrupt.
 */
static inline bool FLEXIO_HAL_GetShifterInterrupt(FLEXIO_Type *baseAddr, uint8_t interruptNo)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(interruptNo < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    return (bool)BITBAND_ACCESS32(&(baseAddr->SHIFTSIEN), interruptNo);
}


/*!
 * @brief Enables or disables the shifter interrupts.
 *
 * Enable or disable specified shifter interrupts. The interrupt mask must contain a
 * bit of 1 for each shifter who's interrupt must be enabled or disabled.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] interruptMask Mask of the interrupts to be enabled/disabled.
 * @param[in] enable Specifies whether to enable or disable specified interrupts.
 */
static inline void FLEXIO_HAL_SetShifterInterrupt(FLEXIO_Type *baseAddr, uint8_t interruptMask, bool enable)
{
    uint32_t tmp;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT((interruptMask & -(1 << FLEXIO_HAL_GetShifterNum(baseAddr))) == 0);
#endif

    tmp = baseAddr->SHIFTSIEN;

    if (enable == true)
    {
        tmp |= interruptMask;
    }
    else
    {
        tmp &= ~interruptMask;
    }
    baseAddr->SHIFTSIEN = tmp;
}


/*!
 * @brief Returns the current status of the shifter error interrupts.
 *
 * Returns the state of the error interrupt for the specified shifter.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] interruptNo Number of the interrupt.
 * @return  Status of the specified interrupt.
 */
static inline bool FLEXIO_HAL_GetShifterErrorInterrupt(FLEXIO_Type *baseAddr, uint8_t interruptNo)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(interruptNo < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    return (bool)BITBAND_ACCESS32(&(baseAddr->SHIFTEIEN), interruptNo);
}


/*!
 * @brief Enables or disables the shifter error interrupts.
 *
 * Enable or disable specified shifter error interrupts. The interrupt mask must contain a
 * bit of 1 for each shifter who's error interrupt must be enabled or disabled.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] interruptMask Mask of the interrupts to be enabled/disabled.
 * @param[in] enable Specifies whether to enable or disable specified interrupts.
 */
static inline void FLEXIO_HAL_SetShifterErrorInterrupt(FLEXIO_Type *baseAddr, uint8_t interruptMask, bool enable)
{
    uint32_t tmp;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT((interruptMask & ~((1U << FLEXIO_HAL_GetShifterNum(baseAddr)) - 1U)) == 0);
#endif

