arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_flexio_hal.h
    tmp = baseAddr->SHIFTEIEN;

    if (enable == true)
    {
        tmp |= interruptMask;
    }
    else
    {
        tmp &= ~interruptMask;
    }
    baseAddr->SHIFTEIEN = tmp;
}


/*!
 * @brief Returns the current status of the timer interrupts.
 *
 * Returns the state of the interrupt for the specified timer.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] interruptNo Number of the interrupt.
 * @return  Status of the specified interrupt.
 */
static inline bool FLEXIO_HAL_GetTimerInterrupt(FLEXIO_Type *baseAddr, uint8_t interruptNo)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(interruptNo < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    return (bool)BITBAND_ACCESS32(&(baseAddr->TIMIEN), interruptNo);
}


/*!
 * @brief Enables or disables the timer interrupts.
 *
 * Enable or disable specified timer interrupts. The interrupt mask must contain a
 * bit of 1 for each timer who's interrupt must be enabled or disabled.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] interruptMask Mask of the interrupts to be enabled/disabled.
 * @param[in] enable Specifies whether to enable or disable specified interrupts.
 */
static inline void FLEXIO_HAL_SetTimerInterrupt(FLEXIO_Type *baseAddr, uint8_t interruptMask, bool enable)
{
    uint32_t tmp;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT((interruptMask & -(1 << FLEXIO_HAL_GetTimerNum(baseAddr))) == 0);
#endif

    tmp = baseAddr->TIMIEN;

    if (enable == true)
    {
        tmp |= interruptMask;
    }
    else
    {
        tmp &= ~interruptMask;
    }
    baseAddr->TIMIEN = tmp;
}


/*!
 * @brief Returns the current status of the shifter DMA requests.
 *
 * Returns the state of the DMA request for the specified shifter.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] requestNo Number of the DMA request.
 * @return  Status of the specified DMA request.
 */
static inline bool FLEXIO_HAL_GetShifterDMARequest(FLEXIO_Type *baseAddr, uint8_t requestNo)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(requestNo < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    return (bool)BITBAND_ACCESS32(&(baseAddr->SHIFTSDEN), requestNo);
}


/*!
 * @brief Enables or disables the shifter DMA requests.
 *
 * Enable or disable specified shifter DMA requests. The request mask must contain a
 * bit of 1 for each shifter who's DMA requests must be enabled or disabled.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] requestMask Mask of the DMA requests to be enabled/disabled.
 * @param[in] enable Specifies whether to enable or disable specified DMA requests.
 */
static inline void FLEXIO_HAL_SetShifterDMARequest(FLEXIO_Type *baseAddr, uint8_t requestMask, bool enable)
{
    uint32_t tmp;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT((requestMask & ~((1U << FLEXIO_HAL_GetShifterNum(baseAddr)) - 1U)) == 0);
#endif

    tmp = baseAddr->SHIFTSDEN;

    if (enable == true)
    {
        tmp |= requestMask;
    }
    else
    {
        tmp &= ~requestMask;
    }
    baseAddr->SHIFTSDEN = tmp;
}


/*!
 * @brief Returns the current shifter state pointer.
 *
 * Returns the current state pointer for shifters configured in state mode.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @return  Current shifter state pointer.
 */
static inline uint8_t FLEXIO_HAL_GetShifterStatePointer(FLEXIO_Type *baseAddr)
{
    return (uint8_t)(baseAddr->SHIFTSTATE);
}


/*!
 * @brief Sets the current shifter state pointer.
 *
 * Sets the current state pointer for shifters configured in state mode.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] state Initial value of the  shifter state pointer.
 */
static inline void FLEXIO_HAL_SetShifterStatePointer(FLEXIO_Type *baseAddr, uint8_t state)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(state < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    baseAddr->SHIFTSTATE = (uint32_t)state;
}


/*!
 * @brief Returns the timer currently assigned to control the specified shifter.
 *
 * This function returns the timer currently assigned to control the specified shifter, and also its polarity.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[out] timer Number of the timer.
 * @param[out] polarity Polarity of the timer.
 */
static inline void FLEXIO_HAL_GetShifterTimer(FLEXIO_Type *baseAddr,
                                              uint8_t shifter,
                                              uint8_t *timer,
                                              flexio_timer_polarity_t *polarity)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->SHIFTCTL[shifter];
    *timer = (uint8_t)((tmp & FLEXIO_SHIFTCTL_TIMSEL_MASK) >> FLEXIO_SHIFTCTL_TIMSEL_SHIFT);
    *polarity = (flexio_timer_polarity_t)((tmp & FLEXIO_SHIFTCTL_TIMPOL_MASK) >> FLEXIO_SHIFTCTL_TIMPOL_SHIFT);
}


/*!
 * @brief Assigns the specified timer to control the specified shifter.
 *
 * This function assigns a timer to control the specified shifter, and also configures its polarity.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] timer Number of the timer.
 * @param[in] polarity Polarity of the timer.
 */
static inline void FLEXIO_HAL_SetShifterTimer(FLEXIO_Type *baseAddr,
                                              uint8_t shifter,
                                              uint8_t timer,
                                              flexio_timer_polarity_t polarity)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->SHIFTCTL[shifter];
    tmp &= ~(FLEXIO_SHIFTCTL_TIMSEL_MASK);
    tmp |= FLEXIO_SHIFTCTL_TIMSEL(timer);
    tmp &= ~(FLEXIO_SHIFTCTL_TIMPOL_MASK);
    tmp |= FLEXIO_SHIFTCTL_TIMPOL(polarity);
    baseAddr->SHIFTCTL[shifter] = tmp;
}


/*!
 * @brief Returns the pin currently assigned to the specified shifter, and its configured settings.
 *
 * This function returns the pin currently assigned to the specified shifter, and also its
 * polarity and configuration.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[out] pin Number of the pin.
 * @param[out] polarity Polarity of the pin.
 * @param[out] config Pin configuration.
 */
static inline void FLEXIO_HAL_GetShifterPin(FLEXIO_Type *baseAddr,
                                            uint8_t shifter,
                                            uint8_t *pin,
                                            flexio_pin_polarity_t *polarity,
                                            flexio_pin_config_t *config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->SHIFTCTL[shifter];
    *pin = (uint8_t)((tmp & FLEXIO_SHIFTCTL_PINSEL_MASK) >> FLEXIO_SHIFTCTL_PINSEL_SHIFT);
    *polarity = (flexio_pin_polarity_t)((tmp & FLEXIO_SHIFTCTL_PINPOL_MASK) >> FLEXIO_SHIFTCTL_PINPOL_SHIFT);
    *config = (flexio_pin_config_t)((tmp & FLEXIO_SHIFTCTL_PINCFG_MASK) >> FLEXIO_SHIFTCTL_PINCFG_SHIFT);
}


/*!
 * @brief Assigns the specified pin to the specified shifter.
 *
 * This function assigns the specified pin to the specified shifter, and also sets
 * its polarity and configuration.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] pin Number of the pin.
 * @param[in] polarity Polarity of the pin.
 * @param[in] config Pin configuration.
 */
static inline void FLEXIO_HAL_SetShifterPin(FLEXIO_Type *baseAddr,
                                            uint8_t shifter,
                                            uint8_t pin,
                                            flexio_pin_polarity_t polarity,
                                            flexio_pin_config_t config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
    DEV_ASSERT(pin < FLEXIO_HAL_GetPinNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->SHIFTCTL[shifter];
    tmp &= ~(FLEXIO_SHIFTCTL_PINSEL_MASK);
    tmp |= FLEXIO_SHIFTCTL_PINSEL(pin);
    tmp &= ~(FLEXIO_SHIFTCTL_PINPOL_MASK);
    tmp |= FLEXIO_SHIFTCTL_PINPOL(polarity);
    tmp &= ~(FLEXIO_SHIFTCTL_PINCFG_MASK);
    tmp |= FLEXIO_SHIFTCTL_PINCFG(config);
    baseAddr->SHIFTCTL[shifter] = tmp;
}


/*!
 * @brief Returns the mode of the specified shifter.
 *
 * This function returns the currently configured mode for the specified shifter.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @return Mode assigned to the shifter.
 */
static inline flexio_shifter_mode_t FLEXIO_HAL_GetShifterMode(FLEXIO_Type *baseAddr, uint8_t shifter)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->SHIFTCTL[shifter];
    tmp = (tmp & FLEXIO_SHIFTCTL_SMOD_MASK) >> FLEXIO_SHIFTCTL_SMOD_SHIFT;
    return (flexio_shifter_mode_t)tmp;
}


/*!
 * @brief Sets the mode of the specified shifter.
 *
 * This function configures the mode for the specified shifter.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] mode Mode assigned to the shifter.
 */
static inline void FLEXIO_HAL_SetShifterMode(FLEXIO_Type *baseAddr,
                                             uint8_t shifter,
                                             flexio_shifter_mode_t mode)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->SHIFTCTL[shifter];
    tmp &= ~(FLEXIO_SHIFTCTL_SMOD_MASK);
    tmp |= FLEXIO_SHIFTCTL_SMOD(mode);
    baseAddr->SHIFTCTL[shifter] = tmp;
}


/*!
 * @brief Returns the parallel width of the specified shifter.
 *
 * This function returns the parallel width configured for the specified shifter.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @return Parallel width configured for the shifter.
 */
static inline uint8_t FLEXIO_HAL_GetShifterParallelWidth(FLEXIO_Type *baseAddr, uint8_t shifter)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp = (tmp & FLEXIO_SHIFTCFG_PWIDTH_MASK) >> FLEXIO_SHIFTCFG_PWIDTH_SHIFT;
    return (uint8_t)tmp;
}


/*!
 * @brief Configures the parallel width of the specified shifter.
 *
 * This configures the parallel width for the specified shifter.
 * This setting configures the number of bits to be shifted on each Shift clock as follows:
 * - 1-bit shift for PWIDTH=0
 * - 4-bit shift for PWIDTH=1...3
 * - 8-bit shift for PWIDTH=4...7
 * - 16-bit shift for PWIDTH=8...15
 * - 32-bit shift for PWIDTH=16...31
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] width Parallel width for the shifter.
 */
static inline void FLEXIO_HAL_SetShifterParallelWidth(FLEXIO_Type *baseAddr, uint8_t shifter, uint8_t width)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp &= ~(FLEXIO_SHIFTCFG_PWIDTH_MASK);
    tmp |= FLEXIO_SHIFTCFG_PWIDTH(width);
    baseAddr->SHIFTCFG[shifter] = tmp;
}


/*!
 * @brief Returns the input source of the specified shifter.
 *
 * This function returns the input source of the specified shifter.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @return Input source selected for the shifter.
 */
static inline flexio_shifter_source_t FLEXIO_HAL_GetShifterInputSource(FLEXIO_Type *baseAddr, uint8_t shifter)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp = (tmp & FLEXIO_SHIFTCFG_INSRC_MASK) >> FLEXIO_SHIFTCFG_INSRC_SHIFT;
    return (flexio_shifter_source_t)tmp;
}


/*!
 * @brief Configures the input source of the specified shifter.
 *
 * This function configures the input source of the specified shifter.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] source Input source selected for the shifter.
 */
static inline void FLEXIO_HAL_SetShifterInputSource(FLEXIO_Type *baseAddr,
                                                    uint8_t shifter,
                                                    flexio_shifter_source_t source)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp &= ~(FLEXIO_SHIFTCFG_INSRC_MASK);
    tmp |= FLEXIO_SHIFTCFG_INSRC(source);
    baseAddr->SHIFTCFG[shifter] = tmp;
}


/*!
 * @brief Returns the stop bit configuration for the specified shifter.
 *
 * This function returns the current configuration for sending or receiving
 * a stop bit in Transmit, Receive or Match Store modes.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @return Stop bit configuration for the shifter.
 */
static inline flexio_shifter_stop_t FLEXIO_HAL_GetShifterStopBit(FLEXIO_Type *baseAddr, uint8_t shifter)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp = (tmp & FLEXIO_SHIFTCFG_SSTOP_MASK) >> FLEXIO_SHIFTCFG_SSTOP_SHIFT;
    return (flexio_shifter_stop_t)tmp;
}


/*!
 * @brief Configures the stop bit of the specified shifter.
 *
 * This function configures the sending or receiving of
 * a stop bit in Transmit, Receive or Match Store modes.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] stop Stop bit configuration for the shifter.
 */
static inline void FLEXIO_HAL_SetShifterStopBit(FLEXIO_Type *baseAddr, uint8_t shifter, flexio_shifter_stop_t stop)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp &= ~(FLEXIO_SHIFTCFG_SSTOP_MASK);
    tmp |= FLEXIO_SHIFTCFG_SSTOP(stop);
    baseAddr->SHIFTCFG[shifter] = tmp;
}


/*!
 * @brief Returns the start bit configuration for the specified shifter.
 *
 * This function returns the current configuration for sending or receiving
 * a start bit in Transmit, Receive or Match Store modes.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @return Start bit configuration for the shifter.
 */
static inline flexio_shifter_start_t FLEXIO_HAL_GetShifterStartBit(FLEXIO_Type *baseAddr, uint8_t shifter)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp = (tmp & FLEXIO_SHIFTCFG_SSTART_MASK) >> FLEXIO_SHIFTCFG_SSTART_SHIFT;
    return (flexio_shifter_start_t)tmp;
}


/*!
 * @brief Configures the start bit of the specified shifter.
 *
 * This function configures the sending or receiving of
 * a start bit in Transmit, Receive or Match Store modes.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] start Start bit configuration for the shifter.
 */
static inline void FLEXIO_HAL_SetShifterStartBit(FLEXIO_Type *baseAddr,
                                                 uint8_t shifter,
                                                 flexio_shifter_start_t start)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp &= ~(FLEXIO_SHIFTCFG_SSTART_MASK);
    tmp |= FLEXIO_SHIFTCFG_SSTART(start);
    baseAddr->SHIFTCFG[shifter] = tmp;
}


/*!
 * @brief Returns the mask for disabling output pins in state mode.
 *
 * This function returns the mask for disabling output pins in state mode.
 * It must not be used in other modes.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @return Mask for disabling output pins in state mode.
 */
static inline uint8_t FLEXIO_HAL_GetShifterStateMask(FLEXIO_Type *baseAddr, uint8_t shifter)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp = ((tmp & FLEXIO_SHIFTCFG_SSTART_MASK) >> FLEXIO_SHIFTCFG_SSTART_SHIFT) |
          ((tmp & FLEXIO_SHIFTCFG_SSTOP_MASK) >> (FLEXIO_SHIFTCFG_SSTOP_SHIFT - 2)) |
          ((tmp & FLEXIO_SHIFTCFG_PWIDTH(0xFU)) >> (FLEXIO_SHIFTCFG_PWIDTH_SHIFT - 4));
    return (uint8_t)tmp;
}


/*!
 * @brief Configures the mask for disabling output pins in state mode.
 *
 * This function configures the mask for disabling output pins in state mode.
 * It must not be used in other modes.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] mask Mask for disabling output pins in state mode.
 */
static inline void FLEXIO_HAL_SetShifterStateMask(FLEXIO_Type *baseAddr,
                                                  uint8_t shifter,
                                                  uint8_t mask)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp &= ~(FLEXIO_SHIFTCFG_PWIDTH_MASK | FLEXIO_SHIFTCFG_SSTOP_MASK | FLEXIO_SHIFTCFG_SSTART_MASK);
    tmp |= FLEXIO_SHIFTCFG_SSTART(mask) | FLEXIO_SHIFTCFG_SSTOP(mask >> 2) | FLEXIO_SHIFTCFG_PWIDTH(mask >> 4);
    baseAddr->SHIFTCFG[shifter] = tmp;
}


/*!
 * @brief Returns the mask for disabling input pins in logic mode.
 *
 * This function returns the mask for disabling input pins in logic mode.
 * It must not be used in other modes.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @return Mask for disabling input pins in logic mode.
 */
static inline uint8_t FLEXIO_HAL_GetShifterLogicMask(FLEXIO_Type *baseAddr, uint8_t shifter)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp = ((tmp & FLEXIO_SHIFTCFG_SSTART_MASK) >> FLEXIO_SHIFTCFG_SSTART_SHIFT) |
          ((tmp & FLEXIO_SHIFTCFG_SSTOP_MASK) >> (FLEXIO_SHIFTCFG_SSTOP_SHIFT - 2));
    return (uint8_t)tmp;
}


/*!
 * @brief Configures the mask for disabling input pins in logic mode.
 *
 * This function configures the mask for disabling input pins in logic mode.
 * It must not be used in other modes.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] mask Mask for disabling input pins in logic mode.
 */
static inline void FLEXIO_HAL_SetShifterLogicMask(FLEXIO_Type *baseAddr,
                                                  uint8_t shifter,
                                                  uint8_t mask)
{
    uint32_t tmp;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    tmp = baseAddr->SHIFTCFG[shifter];
    tmp &= ~(FLEXIO_SHIFTCFG_SSTOP_MASK | FLEXIO_SHIFTCFG_SSTART_MASK);
    tmp |= FLEXIO_SHIFTCFG_SSTART(mask) | FLEXIO_SHIFTCFG_SSTOP(mask >> 2);
    baseAddr->SHIFTCFG[shifter] = tmp;
}


/*!
 * @brief Reads the value from the specified shifter buffer.
 *
 * This function reads data from the specified shifter buffer. The data can be
 * read in any of the four ways allowed by the hardware - see description of type
 * flexio_shifter_buffer_mode_t for details.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] mode Read mode.
 * @return Value read from the shifter buffer.
 */
static inline uint32_t FLEXIO_HAL_ReadShifterBuffer(FLEXIO_Type *baseAddr,
                                                    uint8_t shifter,
                                                    flexio_shifter_buffer_mode_t mode)
{
    uint32_t data;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    switch (mode)
    {
        case FLEXIO_SHIFTER_RW_MODE_NORMAL:
            data = baseAddr->SHIFTBUF[shifter];
            break;
        case FLEXIO_SHIFTER_RW_MODE_BIT_SWAP:
            data = baseAddr->SHIFTBUFBIS[shifter];
            break;
        case FLEXIO_SHIFTER_RW_MODE_BYTE_SWAP:
            data = baseAddr->SHIFTBUFBYS[shifter];
            break;
        case FLEXIO_SHIFTER_RW_MODE_BB_SWAP:
            data = baseAddr->SHIFTBUFBBS[shifter];
            break;
        default:
            /* bad read mode */
            data = 0;
            break;
    }
    return data;
}


/*!
 * @brief Writes a value in the specified shifter buffer.
 *
 * This function writes data in the specified shifter buffer. The data can be
 * written in any of the four ways allowed by the hardware - see description of type
 * flexio_shifter_buffer_mode_t for details.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] shifter Number of the shifter.
 * @param[in] value Value to write in the shifter buffer.
 * @param[in] mode Write mode.
 */
static inline void FLEXIO_HAL_WriteShifterBuffer(FLEXIO_Type *baseAddr,
                                                 uint8_t shifter,
                                                 uint32_t value,
                                                 flexio_shifter_buffer_mode_t mode)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(shifter < FLEXIO_HAL_GetShifterNum(baseAddr));
#endif
    switch (mode)
    {
        case FLEXIO_SHIFTER_RW_MODE_NORMAL:
            baseAddr->SHIFTBUF[shifter] = value;
            break;
        case FLEXIO_SHIFTER_RW_MODE_BIT_SWAP:
            baseAddr->SHIFTBUFBIS[shifter] = value;
            break;
        case FLEXIO_SHIFTER_RW_MODE_BYTE_SWAP:
            baseAddr->SHIFTBUFBYS[shifter] = value;
            break;
        case FLEXIO_SHIFTER_RW_MODE_BB_SWAP:
            baseAddr->SHIFTBUFBBS[shifter] = value;
            break;
        default:
            /* bad write mode */
            break;
    }
}


/*!
 * @brief Returns the currently configured trigger for the specified timer.
 *
 * This function returns the currently configured trigger for the specified timer,
 * and also its source (internal or external) and polarity settings.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[out] trigger Number of the trigger.
 * @param[out] polarity Polarity of the trigger.
 * @param[out] source Trigger source.
 */
static inline void FLEXIO_HAL_GetTimerTrigger(FLEXIO_Type *baseAddr,
                                              uint8_t timer,
                                              uint8_t *trigger,
                                              flexio_trigger_polarity_t *polarity,
                                              flexio_trigger_source_t *source)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCTL[timer];
    *trigger = (uint8_t)((tmp & FLEXIO_TIMCTL_TRGSEL_MASK) >> FLEXIO_TIMCTL_TRGSEL_SHIFT);
    *polarity = (flexio_trigger_polarity_t)((tmp & FLEXIO_TIMCTL_TRGPOL_MASK) >> FLEXIO_TIMCTL_TRGPOL_SHIFT);
    *source = (flexio_trigger_source_t)((tmp & FLEXIO_TIMCTL_TRGSRC_MASK) >> FLEXIO_TIMCTL_TRGSRC_SHIFT);
}


