arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_flexio_hal.h
/*!
 * @brief Configures the trigger for the specified timer.
 *
 * This function configures the trigger for the specified timer, and also its
 * source (internal or external) and polarity settings.
 * For internal triggers, the selection is as follows:
 *  - 4*N - Pin 2*N input
 *  - 4*N+1 - Shifter N status flag
 *  - 4*N+2 - Pin 2*N+1 input
 *  - 4*N+3 - Timer N trigger output
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] trigger Number of the trigger.
 * @param[in] polarity Polarity of the trigger.
 * @param[in] source Trigger source.
 */
static inline void FLEXIO_HAL_SetTimerTrigger(FLEXIO_Type *baseAddr,
                                                 uint8_t timer,
                                                 uint8_t trigger,
                                                 flexio_trigger_polarity_t polarity,
                                                 flexio_trigger_source_t source)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCTL[timer];
    tmp &= ~(FLEXIO_TIMCTL_TRGSEL_MASK);
    tmp |= FLEXIO_TIMCTL_TRGSEL(trigger);
    tmp &= ~(FLEXIO_TIMCTL_TRGPOL_MASK);
    tmp |= FLEXIO_TIMCTL_TRGPOL(polarity);
    tmp &= ~(FLEXIO_TIMCTL_TRGSRC_MASK);
    tmp |= FLEXIO_TIMCTL_TRGSRC(source);
    baseAddr->TIMCTL[timer] = tmp;
}


/*!
 * @brief Returns the currently configured pin for the specified timer.
 *
 * This function returns the pin currently assigned to the specified timer, and also its
 * polarity and configuration.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[out] pin Number of the pin.
 * @param[out] polarity Polarity of the pin.
 * @param[out] config Pin configuration.
 */
static inline void FLEXIO_HAL_GetTimerPin(FLEXIO_Type *baseAddr,
                                              uint8_t timer,
                                              uint8_t *pin,
                                              flexio_pin_polarity_t *polarity,
                                              flexio_pin_config_t *config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCTL[timer];
    *pin = (uint8_t)((tmp & FLEXIO_TIMCTL_PINSEL_MASK) >> FLEXIO_TIMCTL_PINSEL_SHIFT);
    *polarity = (flexio_pin_polarity_t)((tmp & FLEXIO_TIMCTL_PINPOL_MASK) >> FLEXIO_TIMCTL_PINPOL_SHIFT);
    *config = (flexio_pin_config_t)((tmp & FLEXIO_TIMCTL_PINCFG_MASK) >> FLEXIO_TIMCTL_PINCFG_SHIFT);
}


/*!
 * @brief Configures the pin for the specified timer.
 *
 * This function assigns the specified pin to the specified timer, and also sets
 * its polarity and configuration.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] pin Number of the pin.
 * @param[in] polarity Polarity of the pin.
 * @param[in] config Pin configuration.
 */
static inline void FLEXIO_HAL_SetTimerPin(FLEXIO_Type *baseAddr,
                                                 uint8_t timer,
                                                 uint8_t pin,
                                                 flexio_pin_polarity_t polarity,
                                                 flexio_pin_config_t config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
    DEV_ASSERT(pin < FLEXIO_HAL_GetPinNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCTL[timer];
    tmp &= ~(FLEXIO_TIMCTL_PINSEL_MASK);
    tmp |= FLEXIO_TIMCTL_PINSEL(pin);
    tmp &= ~(FLEXIO_TIMCTL_PINPOL_MASK);
    tmp |= FLEXIO_TIMCTL_PINPOL(polarity);
    tmp &= ~(FLEXIO_TIMCTL_PINCFG_MASK);
    tmp |= FLEXIO_TIMCTL_PINCFG(config);
    baseAddr->TIMCTL[timer] = tmp;
}


/*!
 * @brief Returns the mode of the specified timer.
 *
 * This function returns the currently configured mode for the specified timer.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return Mode assigned to the timer.
 */
static inline flexio_timer_mode_t FLEXIO_HAL_GetTimerMode(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCTL[timer];
    tmp = (tmp & FLEXIO_TIMCTL_TIMOD_MASK) >> FLEXIO_TIMCTL_TIMOD_SHIFT;
    return (flexio_timer_mode_t)tmp;
}


/*!
 * @brief Sets the mode of the specified timer.
 *
 * This function configures the mode for the specified timer.
 * In 8-bit counter mode, the lower 8-bits of the counter and compare register are used to
 * configure the baud rate of the timer shift clock and the upper 8-bits are used to configure
 * the shifter bit count.
 * In 8-bit PWM mode, the lower 8-bits of the counter and compare
 * register are used to configure the high period of the timer shift clock and the upper
 * 8-bits are used to configure the low period of the timer shift clock. The shifter bit count
 * is configured using another timer or external signal.
 * In 16-bit counter mode, the full 16-bits of the counter and compare register are used to
 * configure either the baud rate of the shift clock or the shifter bit count.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] mode Mode assigned to the timer.
 */
static inline void FLEXIO_HAL_SetTimerMode(FLEXIO_Type *baseAddr,
                                             uint8_t timer,
                                             flexio_timer_mode_t mode)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCTL[timer];
    tmp &= ~(FLEXIO_TIMCTL_TIMOD_MASK);
    tmp |= FLEXIO_TIMCTL_TIMOD(mode);
    baseAddr->TIMCTL[timer] = tmp;
}


/*!
 * @brief Returns the initial output configuration of the specified timer.
 *
 * This function returns the initial output configuration of the specified timer.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return Output configuration for the timer.
 */
static inline flexio_timer_output_t FLEXIO_HAL_GetTimerInitialOutput(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp = (tmp & FLEXIO_TIMCFG_TIMOUT_MASK) >> FLEXIO_TIMCFG_TIMOUT_SHIFT;
    return (flexio_timer_output_t)tmp;
}


/*!
 * @brief Configures the initial output of the specified timer.
 *
 * This function configures the initial output of the specified timer and whether it is
 * affected by the Timer reset.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] output Output configuration for the timer.
 */
static inline void FLEXIO_HAL_SetTimerInitialOutput(FLEXIO_Type *baseAddr,
                                             uint8_t timer,
                                             flexio_timer_output_t output)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp &= ~(FLEXIO_TIMCFG_TIMOUT_MASK);
    tmp |= FLEXIO_TIMCFG_TIMOUT(output);
    baseAddr->TIMCFG[timer] = tmp;
}


/*!
 * @brief Returns the decrement configuration of the specified timer.
 *
 * This function returns the decrement configuration for the specified timer.
 * See description of type flexio_timer_decrement_t for a list of options.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return Decrement configuration for the timer.
 */
static inline flexio_timer_decrement_t FLEXIO_HAL_GetTimerDecrement(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp = (tmp & FLEXIO_TIMCFG_TIMDEC_MASK) >> FLEXIO_TIMCFG_TIMDEC_SHIFT;
    return (flexio_timer_decrement_t)tmp;
}


/*!
 * @brief Configures the decrement condition for the specified timer.
 *
 * This function configures the decrement condition for the specified timer and the source
 * of the shift clock.
 * See description of type flexio_timer_decrement_t for a list of options.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] decrement Decrement configuration for the timer.
 */
static inline void FLEXIO_HAL_SetTimerDecrement(FLEXIO_Type *baseAddr,
                                             uint8_t timer,
                                             flexio_timer_decrement_t decrement)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp &= ~(FLEXIO_TIMCFG_TIMDEC_MASK);
    tmp |= FLEXIO_TIMCFG_TIMDEC(decrement);
    baseAddr->TIMCFG[timer] = tmp;
}


/*!
 * @brief Returns the reset configuration of the specified timer.
 *
 * This function returns the reset configuration for the specified timer.
 * See description of type flexio_timer_reset_t for a list of options.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return Reset configuration for the timer.
 */
static inline flexio_timer_reset_t FLEXIO_HAL_GetTimerReset(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp = (tmp & FLEXIO_TIMCFG_TIMRST_MASK) >> FLEXIO_TIMCFG_TIMRST_SHIFT;
    return (flexio_timer_reset_t)tmp;
}


/*!
 * @brief Configures the reset condition for the specified timer.
 *
 * This function configures the conditions that cause the timer counter (and optionally
 * output) to be reset. In 8-bit counter mode, the timer reset will only reset the
 * lower 8-bits that configure the baud rate. In all other modes, the timer reset
 * will reset the full 16-bits of the counter.
 * See description of type flexio_timer_decrement_t for a list of options.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] reset Reset configuration for the timer.
 */
static inline void FLEXIO_HAL_SetTimerReset(FLEXIO_Type *baseAddr,
                                             uint8_t timer,
                                             flexio_timer_reset_t reset)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp &= ~(FLEXIO_TIMCFG_TIMRST_MASK);
    tmp |= FLEXIO_TIMCFG_TIMRST(reset);
    baseAddr->TIMCFG[timer] = tmp;
}


/*!
 * @brief Returns the disable configuration of the specified timer.
 *
 * This function returns the condition that cause the specified timer to be disabled.
 * See description of type flexio_timer_disable_t for a list of options.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return Disable configuration for the timer.
 */
static inline flexio_timer_disable_t FLEXIO_HAL_GetTimerDisable(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp = (tmp & FLEXIO_TIMCFG_TIMDIS_MASK) >> FLEXIO_TIMCFG_TIMDIS_SHIFT;
    return (flexio_timer_disable_t)tmp;
}


/*!
 * @brief Configures the disable condition for the specified timer.
 *
 * This function configures the condition that cause the specified timer to be disabled.
 * See description of type flexio_timer_disable_t for a list of options.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] disable Disable configuration for the timer.
 */
static inline void FLEXIO_HAL_SetTimerDisable(FLEXIO_Type *baseAddr,
                                             uint8_t timer,
                                             flexio_timer_disable_t disable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp &= ~(FLEXIO_TIMCFG_TIMDIS_MASK);
    tmp |= FLEXIO_TIMCFG_TIMDIS(disable);
    baseAddr->TIMCFG[timer] = tmp;
}


/*!
 * @brief Returns the enable condition configuration of the specified timer.
 *
 * This function returns the condition that cause the specified timer to be enabled
 * and start decrementing.
 * See description of type flexio_timer_disable_t for a list of options.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return Enable condition configuration for the timer.
 */
static inline flexio_timer_enable_t FLEXIO_HAL_GetTimerEnable(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp = (tmp & FLEXIO_TIMCFG_TIMENA_MASK) >> FLEXIO_TIMCFG_TIMENA_SHIFT;
    return (flexio_timer_enable_t)tmp;
}


/*!
 * @brief Configures the enable condition for the specified timer.
 *
 * This function configures the condition that cause the specified timer to be enabled
 * and start decrementing.
 * See description of type flexio_timer_disable_t for a list of options.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] enable Enable condition configuration for the timer.
 */
static inline void FLEXIO_HAL_SetTimerEnable(FLEXIO_Type *baseAddr,
                                             uint8_t timer,
                                             flexio_timer_enable_t enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp &= ~(FLEXIO_TIMCFG_TIMENA_MASK);
    tmp |= FLEXIO_TIMCFG_TIMENA(enable);
    baseAddr->TIMCFG[timer] = tmp;
}


/*!
 * @brief Returns the stop bit configuration of the specified timer.
 *
 * This function returns the current stop bit configuration for the specified timer.
 * The stop bit can be added on a timer compare (between each word) or on a timer disable.
 * When stop bit is enabled, configured shifters will output the contents of the stop bit
 * when the timer is disabled. When stop bit is enabled on timer disable, the timer remains
 * disabled until the next rising edge of the shift clock. If configured for both timer
 * compare and timer disable, only one stop bit is inserted on timer disable.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return Stop bit configuration for the timer.
 */
static inline flexio_timer_stop_t FLEXIO_HAL_GetTimerStop(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp = (tmp & FLEXIO_TIMCFG_TSTOP_MASK) >> FLEXIO_TIMCFG_TSTOP_SHIFT;
    return (flexio_timer_stop_t)tmp;
}


/*!
 * @brief Configures the stop bit for the specified timer.
 *
 * This function configures stop bit insertion for the specified timer.
 * The stop bit can be added on a timer compare (between each word) or on a timer disable.
 * When stop bit is enabled, configured shifters will output the contents of the stop bit
 * when the timer is disabled. When stop bit is enabled on timer disable, the timer remains
 * disabled until the next rising edge of the shift clock. If configured for both timer
 * compare and timer disable, only one stop bit is inserted on timer disable.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] stop Stop bit configuration for the timer.
 */
static inline void FLEXIO_HAL_SetTimerStop(FLEXIO_Type *baseAddr,
                                             uint8_t timer,
                                             flexio_timer_stop_t stop)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    uint32_t tmp = baseAddr->TIMCFG[timer];
    tmp &= ~(FLEXIO_TIMCFG_TSTOP_MASK);
    tmp |= FLEXIO_TIMCFG_TSTOP(stop);
    baseAddr->TIMCFG[timer] = tmp;
}


/*!
 * @brief Returns the start bit configuration of the specified timer.
 *
 * This function returns the current start bit configuration for the specified timer.
 * When start bit is enabled, configured shifters will output the contents of the start
 * bit when the timer is enabled and the timer counter will reload from the compare
 * register on the first rising edge of the shift clock.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return Start bit configuration for the timer.
 */
static inline flexio_timer_start_t FLEXIO_HAL_GetTimerStart(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    return (flexio_timer_start_t)BITBAND_ACCESS32(&(baseAddr->TIMCFG[timer]), FLEXIO_TIMCFG_TSTART_SHIFT);
}


/*!
 * @brief Configures the start bit for the specified timer.
 *
 * This function configures start bit insertion for the specified timer.
 * When start bit is enabled, configured shifters will output the contents of the start
 * bit when the timer is enabled and the timer counter will reload from the compare
 * register on the first rising edge of the shift clock.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] start Start bit configuration for the timer.
 */
static inline void FLEXIO_HAL_SetTimerStart(FLEXIO_Type *baseAddr,
                                             uint8_t timer,
                                             flexio_timer_start_t start)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    BITBAND_ACCESS32(&(baseAddr->TIMCFG[timer]), FLEXIO_TIMCFG_TSTART_SHIFT) = (uint32_t)start;
}


/*!
 * @brief Returns the compare value of the specified timer.
 *
 * This function returns the compare value currently set for the specified timer.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @return Compare value for the specified timer.
 */
static inline uint16_t FLEXIO_HAL_GetTimerCompare(FLEXIO_Type *baseAddr, uint8_t timer)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    return (uint16_t)(baseAddr->TIMCMP[timer]);
}


/*!
 * @brief Configures the compare value for the specified timer.
 *
 * This function configures the compare value for the specified timer.
 * The timer compare value is loaded into the timer counter when the timer is first enabled,
 * when the timer is reset and when the timer decrements down to zero.
 * In dual 8-bit counters baud/bit mode, the lower 8-bits configure the baud rate divider
 * and the upper 8-bits configure the number of bits in each word.
 * In dual 8-bit counters PWM mode, the lower 8-bits configure the high period of the output
 * and the upper 8-bits configure the low period.
 * In 16-bit counter mode, the compare value can be used to generate the baud rate divider
 * (if shift clock source is timer output) or the number of bits in each word (when the shift
 * clock source is a pin or trigger input).
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 * @param[in] timer Number of the timer.
 * @param[in] value Compare value for the specified timer.
 */
static inline void FLEXIO_HAL_SetTimerCompare(FLEXIO_Type *baseAddr,
                                             uint8_t timer,
                                             uint16_t value)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(timer < FLEXIO_HAL_GetTimerNum(baseAddr));
#endif
    baseAddr->TIMCMP[timer] = (uint32_t)value;
}


/*!
 * @brief Initializes the FlexIO module to a known state.
 *
 * This function initializes all the registers of the FlexIO module to
 * their reset value.
 *
 * @param[in] baseAddr Base address of the FlexIO module.
 */
void FLEXIO_HAL_Init(FLEXIO_Type *baseAddr);


/*! @}*/
#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_FLEXIO_HAL_H__ */
/*******************************************************************************
 * EOF
 ******************************************************************************/
